tinygo-org/tinygo/lib/arduino-max326xx/arm/system/CMSIS/Device/Maxim/MAX32620/Include/ioman_regs.h
typedef struct {
    uint32_t wud_req_p8 : 2;
    uint32_t            : 30;
} mxc_ioman_wud_req2_t;

typedef struct {
    uint32_t wud_ack_p8 : 2;
    uint32_t            : 30;
} mxc_ioman_wud_ack2_t;

typedef struct {
    uint32_t ali_req_p8 : 2;
    uint32_t            : 30;
} mxc_ioman_ali_req2_t;

typedef struct {
    uint32_t ali_ack_p8 : 2;
    uint32_t            : 30;
} mxc_ioman_ali_ack2_t;


/*
   Typedefed structure(s) for module registers (per instance or section) with direct 32-bit
   access to each register in module.
*/

/*                                                          Offset          Register Description
                                                            =============   ============================================================================ */
typedef struct {
    __IO uint32_t wud_req0;                             /*  0x0000          Wakeup Detect Mode Request Register 0 (P0/P1/P2/P3)                          */
    __IO uint32_t wud_req1;                             /*  0x0004          Wakeup Detect Mode Request Register 1 (P4/P5/P6/P7)                          */
    __IO uint32_t wud_ack0;                             /*  0x0008          Wakeup Detect Mode Acknowledge Register 0 (P0/P1/P2/P3)                      */
    __IO uint32_t wud_ack1;                             /*  0x000C          Wakeup Detect Mode Acknowledge Register 1 (P4/P5/P6/P7)                      */
    __IO uint32_t ali_req0;                             /*  0x0010          Analog Input Request Register 0 (P0/P1/P2/P3)                                */
    __IO uint32_t ali_req1;                             /*  0x0014          Analog Input Request Register 1 (P4/P5/P6/P7)                                */
    __IO uint32_t ali_ack0;                             /*  0x0018          Analog Input Acknowledge Register 0 (P0/P1/P2/P3)                            */
    __IO uint32_t ali_ack1;                             /*  0x001C          Analog Input Acknowledge Register 1 (P4/P5/P6/P7)                            */
    __IO uint32_t ali_connect0;                         /*  0x0020          Analog I/O Connection Control Register 0                                     */
    __IO uint32_t ali_connect1;                         /*  0x0024          Analog I/O Connection Control Register 1                                     */
    __IO uint32_t spix_req;                             /*  0x0028          SPIX I/O Mode Request                                                        */
    __IO uint32_t spix_ack;                             /*  0x002C          SPIX I/O Mode Acknowledge                                                    */
    __IO uint32_t uart0_req;                            /*  0x0030          UART0 I/O Mode Request                                                       */
    __IO uint32_t uart0_ack;                            /*  0x0034          UART0 I/O Mode Acknowledge                                                   */
    __IO uint32_t uart1_req;                            /*  0x0038          UART1 I/O Mode Request                                                       */
    __IO uint32_t uart1_ack;                            /*  0x003C          UART1 I/O Mode Acknowledge                                                   */
    __IO uint32_t uart2_req;                            /*  0x0040          UART2 I/O Mode Request                                                       */
    __IO uint32_t uart2_ack;                            /*  0x0044          UART2 I/O Mode Acknowledge                                                   */
    __IO uint32_t uart3_req;                            /*  0x0048          UART3 I/O Mode Request                                                       */
    __IO uint32_t uart3_ack;                            /*  0x004C          UART3 I/O Mode Acknowledge                                                   */
    __IO uint32_t i2cm0_req;                            /*  0x0050          I2C Master 0 I/O Request                                                     */
    __IO uint32_t i2cm0_ack;                            /*  0x0054          I2C Master 0 I/O Acknowledge                                                 */
    __IO uint32_t i2cm1_req;                            /*  0x0058          I2C Master 1 I/O Request                                                     */
    __IO uint32_t i2cm1_ack;                            /*  0x005C          I2C Master 1 I/O Acknowledge                                                 */
    __IO uint32_t i2cm2_req;                            /*  0x0060          I2C Master 2 I/O Request                                                     */
    __IO uint32_t i2cm2_ack;                            /*  0x0064          I2C Master 2 I/O Acknowledge                                                 */
    __IO uint32_t i2cs_req;                             /*  0x0068          I2C Slave I/O Request                                                        */
    __IO uint32_t i2cs_ack;                             /*  0x006C          I2C Slave I/O Acknowledge                                                    */
    __IO uint32_t spim0_req;                            /*  0x0070          SPI Master 0 I/O Mode Request                                                */
    __IO uint32_t spim0_ack;                            /*  0x0074          SPI Master 0 I/O Mode Acknowledge                                            */
    __IO uint32_t spim1_req;                            /*  0x0078          SPI Master 1 I/O Mode Request                                                */
    __IO uint32_t spim1_ack;                            /*  0x007C          SPI Master 1 I/O Mode Acknowledge                                            */
    __IO uint32_t spim2_req;                            /*  0x0080          SPI Master 2 I/O Mode Request                                                */
    __IO uint32_t spim2_ack;                            /*  0x0084          SPI Master 2 I/O Mode Acknowledge                                            */
    __IO uint32_t spib_req;                             /*  0x0088          SPI Bridge I/O Mode Request                                                  */
    __IO uint32_t spib_ack;                             /*  0x008C          SPI Bridge I/O Mode Acknowledge                                              */
    __IO uint32_t owm_req;                              /*  0x0090          1-Wire Master I/O Mode Request                                               */
    __IO uint32_t owm_ack;                              /*  0x0094          1-Wire Master I/O Mode Acknowledge                                           */
    __IO uint32_t spis_req;                             /*  0x0098          SPI Slave I/O Mode Request                                                   */
    __IO uint32_t spis_ack;                             /*  0x009C          SPI Slave I/O Mode Acknowledge                                               */
    __R  uint32_t rsv0A0[24];                           /*  0x00A0-0x00FC                                                                                */
    __IO uint32_t use_vddioh_0;                         /*  0x0100          Enable VDDIOH Register 0                                                     */
    __IO uint32_t use_vddioh_1;                         /*  0x0104          Enable VDDIOH Register 1                                                     */
    __IO uint32_t use_vddioh_2;                         /*  0x0108          Enable VDDIOH Register 2                                                     */
    __R  uint32_t rsv10C;                               /*  0x010C                                                                                       */
    __IO uint32_t pad_mode;                             /*  0x0110          Pad Mode Control Register                                                    */
    __R  uint32_t rsv114[27];                           /*  0x0114-0x017C                                                                                */
    __IO uint32_t wud_req2;                             /*  0x0180          Wakeup Detect Mode Request Register 2 (P8)                                   */
    __R  uint32_t rsv184;                               /*  0x0184                                                                                       */
    __IO uint32_t wud_ack2;                             /*  0x0188          Wakeup Detect Mode Acknowledge Register 2 (P8)                               */
    __R  uint32_t rsv18C;                               /*  0x018C                                                                                       */
    __IO uint32_t ali_req2;                             /*  0x0190          Analog Input Request Register 2 (P8)                                         */
    __R  uint32_t rsv194;                               /*  0x0194                                                                                       */
    __IO uint32_t ali_ack2;                             /*  0x0198          Analog Input Acknowledge Register 2 (P8)                                     */
    __R  uint32_t rsv19C;                               /*  0x019C                                                                                       */
    __IO uint32_t ali_connect2;                         /*  0x01A0          Analog I/O Connection Control Register 2                                     */
} mxc_ioman_regs_t;


